In [1]:
import pandas as pd
import sqlite3
tmpdb = sqlite3.connect('tmp3.db')
%load_ext sql
%sql sqlite:///tmp3.db
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [3]:
%%sql

CREATE TABLE IF NOT EXISTS PRODUCTS (
  PRODUCT_ID TEXT,
  PRODUCT_NAME TEXT,
  SUPPLIER_ID TEXT,
  CATEGORY_ID TEXT,
  UNIT TEXT,
  PRICE REAL
);

 * sqlite:///tmp3.db
Done.

[]

In [4]:
%%sql

INSERT INTO PRODUCTS (PRODUCT_ID, PRODUCT_NAME, SUPPLIER_ID, CATEGORY_ID, UNIT, PRICE) VALUES
  ('1', 'CHAIS', '1', '1', '10 BOXES*20 BAGS', 18),
  ('2', 'CHANG', '1', '1', '24-12 OZ BOTTLES', 19),
  ('3', 'ANISEED SYRUP', '1', '2', '12-550 ML BOTTLES', 10),
  ('4', 'CHEF ANTON SEASONING', '2', '2', '48- 6 OZ JARS', 22),
  ('5', 'CHEF ANTON MIX', '2', '2', '36 BOXES', 21.35);

 * sqlite:///tmp3.db
5 rows affected.

[]

In [6]:
%%sql

SELECT COUNT(PRODUCT_ID) AS Product_Count
FROM PRODUCTS;

 * sqlite:///tmp3.db
Done.

[(5,)]

In [7]:
%%sql

SELECT AVG(PRICE) AS Average_Price
FROM PRODUCTS;

 * sqlite:///tmp3.db
Done.

[(18.07,)]

In [9]:
%%sql

SELECT SUM(PRICE) AS Total_Price
FROM PRODUCTS;

 * sqlite:///tmp3.db
Done.

[(90.35,)]